[
  {
    "条文编号": "刑法第232条",
    "条文内容": "故意杀人的，处死刑、无期徒刑或者十年以上有期徒刑；情节较轻的，处三年以上十年以下有期徒刑。",
    "解释说明": "故意杀人罪是指故意非法剥夺他人生命的行为。本罪侵犯的客体是他人的生命权利。客观方面表现为非法剥夺他人生命的行为。主观方面必须是故意，包括直接故意和间接故意。",
    "适用范围": "故意杀人",
    "量刑档次": ["死刑", "无期徒刑", "十年以上有期徒刑", "三年以上十年以下有期徒刑"],
    "关键词": ["故意", "杀人", "生命", "死刑", "无期徒刑"]
  },
  {
    "条文编号": "刑法第234条",
    "条文内容": "故意伤害他人身体的，处三年以下有期徒刑、拘役或者管制。犯前款罪，致人重伤的，处三年以上十年以下有期徒刑；致人死亡或者以特别残忍手段致人重伤造成严重残疾的，处十年以上有期徒刑、无期徒刑或者死刑。",
    "解释说明": "故意伤害罪是指故意非法损害他人身体健康的行为。轻伤处三年以下有期徒刑；重伤处三年以上十年以下有期徒刑；致死或特别残忍手段致残处十年以上有期徒刑至死刑。",
    "适用范围": "故意伤害",
    "量刑档次": ["三年以下有期徒刑、拘役或管制", "三年以上十年以下有期徒刑", "十年以上有期徒刑、无期徒刑或死刑"],
    "关键词": ["故意", "伤害", "身体", "重伤", "死亡", "残忍"]
  },
  {
    "条文编号": "刑法第263条",
    "条文内容": "以暴力、胁迫或者其他方法抢劫公私财物的，处三年以上十年以下有期徒刑，并处罚金；有下列情形之一的，处十年以上有期徒刑、无期徒刑或者死刑，并处罚金或者没收财产：（一）入户抢劫的；（二）在公共交通工具上抢劫的；（三）抢劫银行或者其他金融机构的；（四）多次抢劫或者抢劫数额巨大的；（五）抢劫致人重伤、死亡的；（六）冒充军警人员抢劫的；（七）持枪抢劫的；（八）抢劫军用物资或者抢险、救灾、救济物资的。",
    "解释说明": "抢劫罪是以非法占有为目的，以暴力、胁迫或其他方法强行劫取公私财物的行为。基本情形处三年以上十年以下有期徒刑，有加重情节的处十年以上有期徒刑至死刑。",
    "适用范围": "抢劫",
    "量刑档次": ["三年以上十年以下有期徒刑", "十年以上有期徒刑、无期徒刑或死刑"],
    "关键词": ["抢劫", "暴力", "胁迫", "财物", "入户", "持枪", "重伤", "死亡"]
  },
  {
    "条文编号": "刑法第264条",
    "条文内容": "盗窃公私财物，数额较大的，或者多次盗窃、入户盗窃、携带凶器盗窃、扒窃的，处三年以下有期徒刑、拘役或者管制，并处或者单处罚金；数额巨大或者有其他严重情节的，处三年以上十年以下有期徒刑，并处罚金；数额特别巨大或者有其他特别严重情节的，处十年以上有期徒刑或者无期徒刑，并处罚金或者没收财产。",
    "解释说明": "盗窃罪是以非法占有为目的，秘密窃取公私财物的行为。根据数额大小和情节严重程度分为三个量刑档次。",
    "适用范围": "盗窃",
    "量刑档次": ["三年以下有期徒刑、拘役或管制", "三年以上十年以下有期徒刑", "十年以上有期徒刑或无期徒刑"],
    "关键词": ["盗窃", "财物", "数额", "入户", "凶器", "扒窃", "多次"]
  },
  {
    "条文编号": "刑法第17条",
    "条文内容": "已满十六周岁的人犯罪，应当负刑事责任。已满十四周岁不满十六周岁的人，犯故意杀人、故意伤害致人重伤或者死亡、强奸、抢劫、贩卖毒品、放火、爆炸、投毒罪的，应当负刑事责任。已满十二周岁不满十四周岁的人，犯故意杀人、故意伤害罪，致人死亡或者以特别残忍手段致人重伤造成严重残疾，情节恶劣，经最高人民检察院核准追诉的，应当负刑事责任。",
    "解释说明": "刑事责任年龄的规定。完全刑事责任年龄为16周岁，相对刑事责任年龄为14-16周岁，12-14周岁仅对特定严重犯罪在特殊情况下承担刑事责任。",
    "适用范围": "刑事责任年龄",
    "量刑档次": [],
    "关键词": ["年龄", "刑事责任", "十六周岁", "十四周岁", "十二周岁", "未成年"]
  },
  {
    "条文编号": "刑法第65条",
    "条文内容": "被判处有期徒刑以上刑罚的犯罪分子，刑罚执行完毕或者赦免以后，在五年以内再犯应当判处有期徒刑以上刑罚之罪的，是累犯，应当从重处罚，但是过失犯罪和不满十八周岁的人犯罪的除外。",
    "解释说明": "一般累犯的构成要件：前罪被判有期徒刑以上刑罚；刑罚执行完毕或赦免后五年内；再犯应判有期徒刑以上刑罚之罪；主观上为故意犯罪且犯罪时已满十八周岁。",
    "适用范围": "累犯",
    "量刑档次": [],
    "关键词": ["累犯", "有期徒刑", "五年", "从重处罚", "故意犯罪"]
  },
  {
    "条文编号": "刑法第72条",
    "条文内容": "对于被判处拘役、三年以下有期徒刑的犯罪分子，同时符合下列条件的，可以宣告缓刑，对其中不满十八周岁的人、怀孕的妇女和已满七十五周岁的人，应当宣告缓刑：（一）犯罪情节较轻；（二）有悔罪表现；（三）没有再犯罪的危险；（四）宣告缓刑对所居住社区没有重大不良影响。",
    "解释说明": "缓刑的适用条件。适用于拘役、三年以下有期徒刑，且犯罪情节较轻、有悔罪表现、没有再犯危险、对社区无重大不良影响。对未成年人、孕妇、75岁以上老人应当宣告缓刑。",
    "适用范围": "缓刑",
    "量刑档次": [],
    "关键词": ["缓刑", "三年以下", "犯罪情节", "悔罪", "未成年", "孕妇", "老人"]
  },
  {
    "条文编号": "刑法第67条",
    "条文内容": "犯罪以后自动投案，如实供述自己的罪行的，是自首。对于自首的犯罪分子，可以从轻或者减轻处罚。其中，犯罪较轻的，可以免除处罚。",
    "解释说明": "自首的构成要件：自动投案和如实供述罪行。自首是重要的从轻减轻处罚情节，犯罪较轻的可以免除处罚。",
    "适用范围": "自首",
    "量刑档次": [],
    "关键词": ["自首", "投案", "供述", "从轻", "减轻", "免除处罚"]
  }
] 